erp3l/src/Catalogs/ПараметрыПереоценкиВНАМСФО/ПараметрыПереоценкиВНАМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыПереоценкиВНАМСФО</name>
  <attributes>
    <name>ПланСчетовБД</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодПереоценки</name>
    <type>
      <types>EnumRef.СпособыУчетаПриПереоценкеВНА</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходовПоПереоценке</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходовПоПереоценкеСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходовПоПереоценкеСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходовПоПереоценкеСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходовПоПереоценке</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходовПоПереоценкеСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходовПоПереоценкеСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходовПоПереоценкеСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНакопленнойПереоценки</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНакопленнойПереоценкиСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНакопленнойПереоценкиСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНакопленнойПереоценкиСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРезерва</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРезерваСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРезерваСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРезерваСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ДооценкаНаВсюСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/ПараметрыПереоценкиВНАМСФО/ManagerModule.bsl
Функция ПолучитьИменаСубконто() Экспорт 
	
	Результат = Новый Структура;
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетДоходовПоПереоценкеСубконто1");
	Субконто.Вставить(2, "СчетДоходовПоПереоценкеСубконто2");
	Субконто.Вставить(3, "СчетДоходовПоПереоценкеСубконто3");
	
	Результат.Вставить("СчетДоходовПоПереоценке", Субконто);
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетРасходовПоПереоценкеСубконто1");
	Субконто.Вставить(2, "СчетРасходовПоПереоценкеСубконто2");
	Субконто.Вставить(3, "СчетРасходовПоПереоценкеСубконто3");
	
	Результат.Вставить("СчетРасходовПоПереоценке", Субконто);
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетНакопленнойПереоценкиСубконто1");
	Субконто.Вставить(2, "СчетНакопленнойПереоценкиСубконто2");
	Субконто.Вставить(3, "СчетНакопленнойПереоценкиСубконто3");
	
	Результат.Вставить("СчетНакопленнойПереоценки", Субконто);	
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетУчетаРезерваСубконто1");
	Субконто.Вставить(2, "СчетУчетаРезерваСубконто2");
	Субконто.Вставить(3, "СчетУчетаРезерваСубконто3");
	
	Результат.Вставить("СчетУчетаРезерва", Субконто);		
	
	Возврат Результат;
	
КонецФункции
